## Data Frame

In [1]:
import pandas as pd

In [5]:
# to create the dataframe using dictionary....
d1={'name':['mani','kal','ram'],
   'rlno':[10,20,30],
   'course':['CSE','ECE','EEE']}
df=pd.DataFrame(d1)
df

   name  rlno course
0  mani    10    CSE
1   kal    20    ECE
2   ram    30    EEE

In [7]:
import numpy as np
n1=np.array([[1,2,3],[4,5,6]])
df2=pd.DataFrame(n1)
df2

   0  1  2
0  1  2  3
1  4  5  6

In [8]:
# to print the dataframe columns names
df.columns

Index(['name', 'rlno', 'course'], dtype='object')

In [9]:
# to print the dataframe row value
df.values

array([['mani', 10, 'CSE'],
       ['kal', 20, 'ECE'],
       ['ram', 30, 'EEE']], dtype=object)

In [10]:
print(len(df.values))

3

In [11]:
# to get the dataframe index names
print(df.index)

RangeIndex(start=0, stop=3, step=1)

In [12]:
df

   name  rlno course
0  mani    10    CSE
1   kal    20    ECE
2   ram    30    EEE

In [13]:
#rows and columns
print(df.shape)

(3, 3)

#### pandas indexing
- to get the data from a dataframe using row and column indexing

In [14]:
# to get only specific column data
df['name']

0    mani
1     kal
2     ram
Name: name, dtype: object

In [16]:
# to print dataframe with different columns
df[['name','course']]

   name course
0  mani    CSE
1   kal    ECE
2   ram    EEE

In [17]:
# to get the first 5 records
df.head()

   name  rlno course
0  mani    10    CSE
1   kal    20    ECE
2   ram    30    EEE

In [19]:
# to get first 2 records
df.head(2)

   name  rlno course
0  mani    10    CSE
1   kal    20    ECE

In [21]:
# to print last record
df.tail(1)

  name  rlno course
2  ram    30    EEE

In [22]:
df.rlno[1]

20

In [23]:
df.iloc[1,1]

20

In [3]:
df.loc[(df['rlno']==20)]

  name  rlno course
1  kal    20    ECE

In [6]:
# to get the data in a specific range
df.loc[(df['rlno']<30) & (df['rlno']>10)]

  name  rlno course
1  kal    20    ECE

In [31]:
df=df.dropna()
df

   name  rlno course
0  mani    10    CSE
1   kal    20    ECE
2   ram    30    EEE

In [33]:
# to delete  row to dataframe
df.dropna(inplace=True)
df

   name  rlno course
0  mani    10    CSE
1   kal    20    ECE
2   ram    30    EEE

In [34]:
# to add new column to dataframe
df['branch']=['java','python','c']
df

   name  rlno course  branch
0  mani    10    CSE    java
1   kal    20    ECE  python
2   ram    30    EEE       c

In [35]:
# to update the specific vale
df.loc[2,'branch']='data analysis'
df

   name  rlno course         branch
0  mani    10    CSE           java
1   kal    20    ECE         python
2   ram    30    EEE  data analysis

In [36]:
df.iloc
df

          name    rlno  course         branch
0         mani      10     CSE           java
1          kal      20     ECE         python
2          ram      30     EEE  data analysis
course  branch  branch  branch         branch

In [37]:
print(df.iloc[1,1])
print(df.loc[1,'name'])

20
kal

In [38]:
# to print only specific row
df.iloc[1]

name         kal
rlno          20
course       ECE
branch    python
Name: 1, dtype: object

In [39]:
df.loc[2]

name                ram
rlno                 30
course              EEE
branch    data analysis
Name: 2, dtype: object

In [40]:
df.iloc[:,0]

0           mani
1            kal
2            ram
course    branch
Name: name, dtype: object

In [41]:
# to delete data from a dataframe 
#using drop method
df

          name    rlno  course         branch
0         mani      10     CSE           java
1          kal      20     ECE         python
2          ram      30     EEE  data analysis
course  branch  branch  branch         branch

In [46]:
df

          name    rlno  course  branch
0         mani      10     CSE    java
course  branch  branch  branch  branch

In [48]:
df.drop('branch',axis=1,inplace=True)
df

          name    rlno  course
0         mani      10     CSE
course  branch  branch  branch

In [53]:
df.drop(df.index[df['rlno'] ==10], inplace=True)
df

          name    rlno  branch
course  branch  branch  branch

In [52]:
# to rename the paricular singular column name
df.rename(columns={'course':'branch'},inplace=True)
df

          name    rlno  branch
0         mani      10     CSE
course  branch  branch  branch

In [3]:
import pandas as pd
d1={'name':['narshimha','tony','srinadh','mohan'],
    'rlno':[478,488,437,473],
   'city':['singarayakonda','nellore','martur','vizag'],
   'contact number':[9548318463,9448143445,9843215415,6595384415]}
df=pd.DataFrame(d1)
df

        name  rlno            city  contact number
0  narshimha   478  singarayakonda      9548318463
1       tony   488         nellore      9448143445
2    srinadh   437          martur      9843215415
3      mohan   473           vizag      6595384415

In [5]:
df.values

array([['narshimha', 478, 'singarayakonda', 9548318463],
       ['tony', 488, 'nellore', 9448143445],
       ['srinadh', 437, 'martur', 9843215415],
       ['mohan', 473, 'vizag', 6595384415]], dtype=object)

In [6]:
df.shape # to get rows and columns

(4, 4)

In [7]:
df.columns

Index(['name', 'rlno', 'city', 'contact number'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
df['name']

0    narshimha
1         tony
2      srinadh
3        mohan
Name: name, dtype: object

In [12]:
df[['name','rlno']]

        name  rlno
0  narshimha   478
1       tony   488
2    srinadh   437
3      mohan   473

In [18]:
df.loc[(df['name']=='tony')] # how to print only names of students grater than 5 char?

   name  rlno     city  contact number
1  tony   488  nellore      9448143445

In [7]:
df.loc[2] # details of 2nd row

name                 srinadh
rlno                     437
city                  martur
contact number    9843215415
Name: 2, dtype: object

In [10]:
df.iloc[3,1] # 3rd row 1st column

473

In [1]:
import pandas as pd
df={'name':['ravi','shyam','eswar','gopi'],
   'rollno':[25,18,21,7],
   'city':['guntur','hyderabad','hyderabad','ukraine'],
   'mobileno':[944654843,9558765454,9454412789,6546389145]}
df1=pd.DataFrame(df)
df1

    name  rollno       city    mobileno
0   ravi      25     guntur   944654843
1  shyam      18  hyderabad  9558765454
2  eswar      21  hyderabad  9454412789
3   gopi       7    ukraine  6546389145

In [2]:
df1.columns

Index(['name', 'rollno', 'city', 'mobileno'], dtype='object')

In [6]:
df1.shape

(4, 4)

In [7]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
df1.values

array([['ravi', 25, 'guntur', 944654843],
       ['shyam', 18, 'hyderabad', 9558765454],
       ['eswar', 21, 'hyderabad', 9454412789],
       ['gopi', 7, 'ukraine', 6546389145]], dtype=object)

In [10]:
df1.head(2)

    name  rollno       city    mobileno
0   ravi      25     guntur   944654843
1  shyam      18  hyderabad  9558765454

In [13]:
df1.tail(1)

   name  rollno     city    mobileno
3  gopi       7  ukraine  6546389145

In [14]:
df1['name']

0     ravi
1    shyam
2    eswar
3     gopi
Name: name, dtype: object

In [21]:
df1[['name','rollno','city']]

    name  rollno       city
0   ravi      25     guntur
1  shyam      18  hyderabad
2  eswar      21  hyderabad
3   gopi       7    ukraine

In [23]:
df1.iloc[1,0]# row,column

'shyam'

In [29]:
df1.loc[1,'city']='vizag'# if we use iloc here it will give error
df1

    name  rollno       city    mobileno
0   ravi      25     guntur   944654843
1  shyam      18      vizag  9558765454
2  eswar      21  hyderabad  9454412789
3   gopi       7    ukraine  6546389145

In [2]:
# to delete a row from the record
df1

NameError: name 'df1' is not defined